programming/python/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>python - labs127.io and me</title>
<!-- 2016-05-26 Thu 22:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kholid Fuadi" />
<link rel="stylesheet" type="text/css" href="../../stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">python - labs127.io and me</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Deploy Flask + Nginx + Supervisor di Ubuntu</a>
<ul>
<li><a href="#sec-1-1">1.1. Add user di Ubuntu</a></li>
<li><a href="#sec-1-2">1.2. Install needed package</a></li>
<li><a href="#sec-1-3">1.3. Install virtualenv &amp; supervisor</a></li>
<li><a href="#sec-1-4">1.4. git clone</a></li>
<li><a href="#sec-1-5">1.5. Setting virtualenv</a></li>
<li><a href="#sec-1-6">1.6. Setting supervisor</a></li>
<li><a href="#sec-1-7">1.7. Sunting berkas run.py</a></li>
<li><a href="#sec-1-8">1.8. Setting nginx</a></li>
<li><a href="#sec-1-9">1.9. Jalankan supervisor</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Install library lxml di dalam virtualenv</a></li>
<li><a href="#sec-3">3. Catch search engine terms with python, flask and mongo</a></li>
<li><a href="#sec-4">4. Mencegah Cascade di django models</a></li>
<li><a href="#sec-5">5. CSS, JS dan IMG tidak mau load di django-admin</a></li>
<li><a href="#sec-6">6. Setting gunicorn + django + nginx</a></li>
<li><a href="#sec-7">7. Up and Running with django-cookiecutter</a></li>
<li><a href="#sec-8">8. Akses ebay SOAP API dengan Python</a></li>
<li><a href="#sec-9">9. Konfigurasi dan Implementasi PostgreSQL HStoreField di django</a></li>
<li><a href="#sec-10">10. Setting nginx + uwsgi + supervisor + django</a></li>
<li><a href="#sec-11">11. Port di django vagrant</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Deploy Flask + Nginx + Supervisor di Ubuntu</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Add user di Ubuntu</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh">adduser sopier
adduser sopier sudo
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Install needed package</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install build-essential python-dev python-pip nginx
emacs24-nox git
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Install virtualenv &amp; supervisor</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-sh">sudo pip install virtualenv supervisor
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> git clone</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-sh">git clone https://github.com/sopier/example.com
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Setting virtualenv</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-sh">cd example.com
virtualenv .
. bin/activate
pip install -r requirements.txt
pip install uwsgi
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Setting supervisor</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Buat berkas baru, misal di <code>~/supervisord.conf</code>, dan isikan baris
konfigurasi berikut:
</p>
<div class="org-src-container">

<pre class="src src-text">[unix_http_server]
file=/tmp/uwsgi.sock   ; (the path to the socket file)

[supervisord]
logfile=/tmp/supervisord.log ; (main log file;default $CWD/supervisord.log)
logfile_maxbytes=50MB       ; (max main logfile bytes b4 rotation;default 50MB)
logfile_backups=10          ; (num of main logfile rotation backups;default 10)
loglevel=info               ; (log level;default info; others: debug,warn,trace)
pidfile=/tmp/supervisord.pid ; (supervisord pidfile;default supervisord.pid)
nodaemon=false              ; (start in foreground if true;default false)
minfds=1024                 ; (min. avail startup file descriptors;default 1024)
minprocs=200

[rpcinterface:supervisor]
supervisor.rpcinterface_factory = supervisor.rpcinterface:make_main_rpcinterface

[supervisorctl]
logfile=/tmp/supervisord.log ; (main log file;default $CWD/supervisord.log)
serverurl=unix:///tmp/uwsgi.sock ; use a unix:// URL

[program:example.com]
command=/home/sopier/example.com/bin/uwsgi 
	    --socket /tmp/uwsgi.sock 
	    --module run 
	    --callable app -H /home/sopier/example.com/ 
	    --chdir /home/sopier/example.com/ 
	    --chmod-socket=666 
	    --processes=5
directory=/home/sopier/example.com/
autostart=true
autorestart=true
stdout_logfile=/tmp/example.log
redirect_stderr=true
stopsignal=QUIT
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Sunting berkas run.py</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Berikut ini setting untuk run.py (sesuaikan seperlunya):
</p>
<div class="org-src-container">

<pre class="src src-python">#!/usr/bin/env python
from app import app

if __name__ == "__main__":
    app.run(debug=False)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Setting nginx</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Berikut ini adalah konfigurasi nginx sederhana tapi works:
</p>
<div class="org-src-container">

<pre class="src src-text">server {
    listen        80;
    server_name   www.example.com;
    location / { try_files $uri @app; }
    location @app {
	include uwsgi_params;
	uwsgi_pass unix:/tmp/uwsgi.sock;
    }
}
</pre>
</div>
<p>
Atau jika Anda ingin multiple site, berikut ini contoh konfigurasinya:
</p>
<div class="org-src-container">

<pre class="src src-text">server {
    listen        80;
    server_name   www.example1.com;
    location / { try_files $uri @app; }
    location @app {
	include uwsgi_params;
	uwsgi_pass unix:/tmp/uwsgi1.sock;
    }
}
server {
    listen        80;
    server_name   www.example2.com;
    location / { try_files $uri @app; }
    location @app {
	include uwsgi_params;
	uwsgi_pass unix:/tmp/uwsgi2.sock;
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Jalankan supervisor</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Terakhir, jalankan <code>supervisor</code> dengan menjalankan perintah berikut:
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo supervisord -c ~/supervisord.conf
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Install library lxml di dalam virtualenv</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install libxml2-dev libxslt-dev
</pre>
</div>
<p>
Jika server Anda terlalu kecil spec-nya (gagal di DO yang $5/month,
bisa jadi terjadi error, ini terjadi karena proses <i>compile</i>
membutuhkan <i>memory</i> besar. Untuk menambah memory, kita sementara
dapat menambah <code>swap</code>.
</p>

<p>
Caranya adalah sebagai berikut:
</p>

<div class="org-src-container">

<pre class="src src-sh"># create new partition
dd if=/dev/zero of=/swapfile bs=1M count=1024
# set as swap
mkswap /swapfile
# activate the swap once
swapon /swapfile
# run every machine reboot (optional)
/swapfile swap swap defaults 0 0 # add into /etc/fstab
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Catch search engine terms with python, flask and mongo</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-python"># pip install referer_parser
from referer_parser import Referer
# dbase
import pymongo

c = pymongo.Connection()
refdb = c['referer']

# ganti "-" =&gt; " " pada q
t = q.replace("-", " ")

# referer tracker
try:
    head = request.headers
    url = head['Referer']
    refobj = Referer(url)
    # setem ini sudah bersih!
    setem = refobj.search_term

    # jika ada setem, input into db                                                

    if setem:
	# jika lom ada setem, insert!                                              

	if refdb.term.find_one({"q": t}) is None:
	    refdb.term.insert({"q": t, "refer": {setem: 1}})
	# jika sudah ada, pilihannya ada 2, set atau increment!
	else:
	    # jika sudah ada setem, increment!                                    

	    if setem in refdb.term.find_one({"q": t})['refer']:
		refdb.term.update(
		    {"q": t},
		    {"$inc": {"refer." + str(setem): 1}},
		    upsert=True
		)
	    # jika lom ada setem, set setem: 1!                                    

	    elif setem not in refdb.term.find_one({"q": t})['refer']:
		refdb.term.update(
		    {"q": t},
		    {"$set": {"refer." + str(setem): 1}},
		    upsert=True
		)
except:
    pass

# sorting term
sorted(
    db.term.find_one({"q": t})['refer'].items(),
    key=lambda x: x[1],
    reverse=True
)
</pre>
</div>
</div>
</div>
