programming/python/index.org
* Mencegah Cascade di django models
django, by default menggunakan cascade untuk model ForeignKey, ini artinya
jika data child dihapus maka data parent juga ikut terhapus. Untuk mencegah
hal ini, kita dapat menambahkan argument berikut:

#+BEGIN_SRC python
  nama = models.ForeignKey(Guru, on_delete=models.SET_NULL)
#+END_SRC

Jika setting sudah benar, tandanya ada tanda silang di sebelah field
ForeignKey.
* CSS, JS dan IMG tidak mau load di django-admin
Jika hal ini terjadi, berarti setting nginx Anda perlu dibenahi, yakni
dengan menambahkan location /static/ di konfig nginx Anda, misal
sebagai berikut:

#+BEGIN_SRC text
  server {
      ...
  
      location /static/ {
          alias /home/sopier/mslib/mslib/static/;
      }
      
      ...
  }
#+END_SRC
* Setting gunicorn + django + nginx
Dengan asumsi struktur direktori sebagai berikut:

#+BEGIN_SRC text
  mslib/
  ├── app
  │   ├── admin.py
  │   ├── __init__.py
  │   ├── migrations
  │   ├── models.py
  │   ├── tests.py
  │   ├── urls.py
  │   ├── views.py
  ├── manage.py
  ├── mslib
  │   ├── __init__.py
  │   ├── settings.py
  │   ├── urls.py
  │   ├── wsgi.py
  ├── static
  │   ├── admin
  │   ├── app
  │   └── js
  └── templates
      ├── 404.html
      ├── admin
      └── app
#+END_SRC

Dan berikut ini setting untuk nginx:

#+BEGIN_SRC text
  upstream app_server {
     server 127.0.0.1:8000 fail_timeout=0;
  }
  
  server {
     listen 80;
     server_name 159.xxx.xxx.xxx;
     client_max_body_size 4G;
     proxy_read_timeout 1200;
  
     location / {
         proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
         proxy_set_header Host $http_host;
         proxy_redirect off;
         proxy_pass http://app_server;
         if (!-f $request_filename) {
             proxy_pass http://app_server;
             break;
         }
     }
  
     location /static/ {
         alias /home/sopier/mslib/mslib/static/;
     }
  
     location /media/ {
         alias /home/sopier/mslib/mslib/collections/;
     }
  }
#+END_SRC

Maka untuk menjalankan gunicorn:

#+BEGIN_SRC sh
  gunicorn --env DJANGO_SETTINGS_MODULE=mslib.settings mslib.wsgi --bind 127.0.0.1:8000
#+END_SRC
* Up and Running with django-cookiecutter
#+BEGIN_SRC sh
# starting django project with cookiecutter

cookiecutter https://github.com/pydanny/cookiecutter-django.git

# choose Y
# It will clone in ~/.cookiecutter
# Follow the wizard

cd into project_name
virtualenv .

# edit requirements/base.txt, add/comment unwanted libs
pip install -r requirements/local.txt

# install gunicorn
pip install gunicorn

# create database name 
sudo -u postgres -i
createdb project_name

# do migration
python manage.py migrate
python manage.py runserver

# creating project/apps
# you can create app straightforward in project_name/ dir
python manage.py createapp myapp

# or
# startproject and createapp
python manage.py startproject myproject
cd myproject
python manage.py createapp myapp

# I prefer the 1st one

# run server with gunicorn
gunicorn --env DJANGO_SETTINGS_MODULE=config.settings.local config.wsgi --bind 127.0.0.1:8000

#+END_SRC
Selanjutnya tinggal buat model di django seperti biasa.
* Akses ebay SOAP API dengan Python
This is how accessing soap api xml in python.

#+BEGIN_SRC python
import json
import requests
from ebaysdk.response import ResponseDataObject, Response

def get_countries():
    """Request SOAP API for Country.
    """

    headers = {
        'X-EBAY-API-SITEID': 0,
        'X-EBAY-API-DEV-NAME': 'your-api-dev',
        'X-EBAY-API-CERT-NAME': 'your-api-cert',
        'Content-Length': '1096',
        'X-EBAY-API-APP-NAME': 'your-api-app',
        'X-EBAY-API-COMPATIBILITY-LEVEL': '837',
        'X-EBAY-SDK-REQUEST-ID': 'your-sdk-request',
        'X-EBAY-API-CALL-NAME': u'GetEbayDetails',
        'User-Agent': 'eBaySDK/2.1.2 Python/2.7.6 Linux/3.13.0-37-generic',
        'Content-Type': 'text/xml'
    }

    body = """
<?xml version="1.0" encoding="utf-8"?>
<GeteBayDetailsRequest xmlns="urn:ebay:apis:eBLBaseComponents">
  <RequesterCredentials>
    <eBayAuthToken>your-token</eBayAuthToken>
  </RequesterCredentials>
  <DetailName>CountryDetails</DetailName>
</GeteBayDetailsRequest>
"""
    resp = requests.post('https://api.ebay.com/ws/api.dll', data=body, headers=headers)
    from ebaysdk.response import ResponseDataObject, Response
    xml = resp.content

    o = ResponseDataObject({'content': xml}, [])
    r = Response(o, verb='findItemsByProduct', list_nodes=['searchResult.item'])

    data = json.loads(r.json(), 'utf8')
    countries = [(i['Country'], i['Description']) for i in data['GeteBayDetailsResponse']['CountryDetails']]
    return countries
#+END_SRC
* Konfigurasi dan Implementasi PostgreSQL HStoreField di django
Install postgresql-contrib-9.3:
#+BEGIN_SRC sh
sudo apt-get install postgresql-contrib-9.3
#+END_SRC
Kemudian jalankan postgre console
#+BEGIN_SRC text
sudo -u postgres -i
psql
\connect dbname
create extension hstore;
#+END_SRC
Output:
#+BEGIN_SRC text
CREATE EXTENSION
#+END_SRC

Kemudian deskripsikan model di django:
#+BEGIN_SRC python
from django.contrib.postgres.fields import HStoreField

class Item(models.Model):
    itemId = models.CharField(max_length=50)
    title = models.CharField(max_length=1000)
    sellerInfo = HStoreField()

    def __unicode__(self):
        return self.title
#+END_SRC

Contoh query:
#+BEGIN_SRC python
i = Item(name='kholidfu', data={'skill': 'python'})
i.save()
#+END_SRC
* Setting nginx + uwsgi + supervisor + django
Berikut setting nginx:
#+BEGIN_SRC text
server {
      listen        80;
      server_name   www.example.com;
      location / { try_files $uri @app; }
      location @app {
          include uwsgi_params;
          uwsgi_pass unix:/tmp/uwsgi.sock;
      }
}
#+END_SRC
Setting uwsgi di =supervisord.conf=:
#+BEGIN_SRC text
[supervisord]
logfile=/tmp/supervisord.log ; (main log file;default $CWD/supervisord.log)
logfile_maxbytes=50MB ; (max main logfile bytes b4 rotation;default 50MB)
logfile_backups=10 ; (num of main logfile rotation backups;default 10)
loglevel=info ; (log level;default info; others: debug,warn,trace)
pidfile=/tmp/supervisord.pid ; (supervisord pidfile;default supervisord.pid)
nodaemon=false ; (start in foreground if true;default false)
minfds=1024 ; (min. avail startup file descriptors;default 1024)
minprocs=200

[program:kresna]
command=/home/sopier/kresna2/bin/uwsgi --socket /tmp/uwsgi.sock --module=config.wsgi:application --env DJANGO_SETTINGS_MODULE=config.settings.production --callable app -H /home/sopier/kresna2/ --chdir /home/sopier/kresna2/ --chmod-socket=666 --processes=5
directory=/home/sopier/kresna2/
autostart=true
autorestart=true
stdout_logfile=/tmp/kresna2.log
redirect_stderr=true
#+END_SRC

Yang harus Anda perhatikan disini adalah letak dari module =wsgi=,
karena saya di sini menggunakan cookiecutter dari pydanny, maka secara
default, file =wsgi.py= berada di direktori =config=. Kalau
menggunakan versi default =startproject= dari django, file wsgi.py
berada di direktori =myproject.wsgi=.

Selamat mencoba!
