programming/python/index.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Mencegah Cascade di django models</h2>
<div class="outline-text-2" id="text-4">
<p>
django, by default menggunakan cascade untuk model ForeignKey, ini artinya
jika data child dihapus maka data parent juga ikut terhapus. Untuk mencegah
hal ini, kita dapat menambahkan argument berikut:
</p>

<div class="org-src-container">

<pre class="src src-python">nama = models.ForeignKey(Guru, on_delete=models.SET_NULL)
</pre>
</div>

<p>
Jika setting sudah benar, tandanya ada tanda silang di sebelah field
ForeignKey.
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> CSS, JS dan IMG tidak mau load di django-admin</h2>
<div class="outline-text-2" id="text-5">
<p>
Jika hal ini terjadi, berarti setting nginx Anda perlu dibenahi, yakni
dengan menambahkan location <i>static</i> di konfig nginx Anda, misal
sebagai berikut:
</p>

<div class="org-src-container">

<pre class="src src-text">server {
    ...

    location /static/ {
	alias /home/sopier/mslib/mslib/static/;
    }

    ...
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Setting gunicorn + django + nginx</h2>
<div class="outline-text-2" id="text-6">
<p>
Dengan asumsi struktur direktori sebagai berikut:
</p>

<div class="org-src-container">

<pre class="src src-text">mslib/
├── app
│   ├── admin.py
│   ├── __init__.py
│   ├── migrations
│   ├── models.py
│   ├── tests.py
│   ├── urls.py
│   ├── views.py
├── manage.py
├── mslib
│   ├── __init__.py
│   ├── settings.py
│   ├── urls.py
│   ├── wsgi.py
├── static
│   ├── admin
│   ├── app
│   └── js
└── templates
    ├── 404.html
    ├── admin
    └── app
</pre>
</div>

<p>
Dan berikut ini setting untuk nginx:
</p>

<div class="org-src-container">

<pre class="src src-text">upstream app_server {
   server 127.0.0.1:8000 fail_timeout=0;
}

server {
   listen 80;
   server_name 159.xxx.xxx.xxx;
   client_max_body_size 4G;
   proxy_read_timeout 1200;

   location / {
       proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
       proxy_set_header Host $http_host;
       proxy_redirect off;
       proxy_pass http://app_server;
       if (!-f $request_filename) {
	   proxy_pass http://app_server;
	   break;
       }
   }

   location /static/ {
       alias /home/sopier/mslib/mslib/static/;
   }

   location /media/ {
       alias /home/sopier/mslib/mslib/collections/;
   }
}
</pre>
</div>

<p>
Maka untuk menjalankan gunicorn:
</p>

<div class="org-src-container">

<pre class="src src-sh">gunicorn --env DJANGO_SETTINGS_MODULE=mslib.settings mslib.wsgi --bind 127.0.0.1:8000
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Up and Running with django-cookiecutter</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-sh"># starting django project with cookiecutter

cookiecutter https://github.com/pydanny/cookiecutter-django.git

# choose Y
# It will clone in ~/.cookiecutter
# Follow the wizard

cd into project_name
virtualenv .

# edit requirements/base.txt, add/comment unwanted libs
pip install -r requirements/local.txt

# install gunicorn
pip install gunicorn

# create database name 
sudo -u postgres -i
createdb project_name

# do migration
python manage.py migrate
python manage.py runserver

# creating project/apps
# you can create app straightforward in project_name/ dir
python manage.py createapp myapp

# or
# startproject and createapp
python manage.py startproject myproject
cd myproject
python manage.py createapp myapp

# I prefer the 1st one

# run server with gunicorn
gunicorn --env DJANGO_SETTINGS_MODULE=config.settings.local config.wsgi --bind 127.0.0.1:8000
</pre>
</div>
<p>
Selanjutnya tinggal buat model di django seperti biasa.
</p>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Akses ebay SOAP API dengan Python</h2>
<div class="outline-text-2" id="text-8">
<p>
This is how accessing soap api xml in python.
</p>

<div class="org-src-container">

<pre class="src src-python">import json
import requests
from ebaysdk.response import ResponseDataObject, Response

def get_countries():
    """Request SOAP API for Country.
    """

    headers = {
	'X-EBAY-API-SITEID': 0,
	'X-EBAY-API-DEV-NAME': 'your-api-dev',
	'X-EBAY-API-CERT-NAME': 'your-api-cert',
	'Content-Length': '1096',
	'X-EBAY-API-APP-NAME': 'your-api-app',
	'X-EBAY-API-COMPATIBILITY-LEVEL': '837',
	'X-EBAY-SDK-REQUEST-ID': 'your-sdk-request',
	'X-EBAY-API-CALL-NAME': u'GetEbayDetails',
	'User-Agent': 'eBaySDK/2.1.2 Python/2.7.6 Linux/3.13.0-37-generic',
	'Content-Type': 'text/xml'
    }

    body = """
&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;GeteBayDetailsRequest xmlns="urn:ebay:apis:eBLBaseComponents"&gt;
  &lt;RequesterCredentials&gt;
    &lt;eBayAuthToken&gt;your-token&lt;/eBayAuthToken&gt;
  &lt;/RequesterCredentials&gt;
  &lt;DetailName&gt;CountryDetails&lt;/DetailName&gt;
&lt;/GeteBayDetailsRequest&gt;
"""
    resp = requests.post('https://api.ebay.com/ws/api.dll', data=body, headers=headers)
    from ebaysdk.response import ResponseDataObject, Response
    xml = resp.content

    o = ResponseDataObject({'content': xml}, [])
    r = Response(o, verb='findItemsByProduct', list_nodes=['searchResult.item'])

    data = json.loads(r.json(), 'utf8')
    countries = [(i['Country'], i['Description']) for i in data['GeteBayDetailsResponse']['CountryDetails']]
    return countries
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Konfigurasi dan Implementasi PostgreSQL HStoreField di django</h2>
<div class="outline-text-2" id="text-9">
<p>
Install postgresql-contrib-9.3:
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install postgresql-contrib-9.3
</pre>
</div>
<p>
Kemudian jalankan postgre console
</p>
<div class="org-src-container">

<pre class="src src-text">sudo -u postgres -i
psql
\connect dbname
create extension hstore;
</pre>
</div>
<p>
Output:
</p>
<div class="org-src-container">

<pre class="src src-text">CREATE EXTENSION
</pre>
</div>

<p>
Kemudian deskripsikan model di django:
</p>
<div class="org-src-container">

<pre class="src src-python">from django.contrib.postgres.fields import HStoreField

class Item(models.Model):
    itemId = models.CharField(max_length=50)
    title = models.CharField(max_length=1000)
    sellerInfo = HStoreField()

    def __unicode__(self):
	return self.title
</pre>
</div>

<p>
Contoh query:
</p>
<div class="org-src-container">

<pre class="src src-python">i = Item(name='kholidfu', data={'skill': 'python'})
i.save()
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Setting nginx + uwsgi + supervisor + django</h2>
<div class="outline-text-2" id="text-10">
<p>
Berikut setting nginx:
</p>
<div class="org-src-container">

<pre class="src src-text">server {
      listen        80;
      server_name   www.example.com;
      location / { try_files $uri @app; }
      location @app {
	  include uwsgi_params;
	  uwsgi_pass unix:/tmp/uwsgi.sock;
      }
}
</pre>
</div>
<p>
Setting uwsgi di <code>supervisord.conf</code>:
</p>
<div class="org-src-container">

<pre class="src src-text">[supervisord]
logfile=/tmp/supervisord.log ; (main log file;default $CWD/supervisord.log)
logfile_maxbytes=50MB ; (max main logfile bytes b4 rotation;default 50MB)
logfile_backups=10 ; (num of main logfile rotation backups;default 10)
loglevel=info ; (log level;default info; others: debug,warn,trace)
pidfile=/tmp/supervisord.pid ; (supervisord pidfile;default supervisord.pid)
nodaemon=false ; (start in foreground if true;default false)
minfds=1024 ; (min. avail startup file descriptors;default 1024)
minprocs=200

[program:kresna]
command=/home/sopier/kresna2/bin/uwsgi --socket /tmp/uwsgi.sock --module=config.wsgi:application --env DJANGO_SETTINGS_MODULE=config.settings.production --callable app -H /home/sopier/kresna2/ --chdir /home/sopier/kresna2/ --chmod-socket=666 --processes=5
directory=/home/sopier/kresna2/
autostart=true
autorestart=true
stdout_logfile=/tmp/kresna2.log
redirect_stderr=true
</pre>
</div>

<p>
Yang harus Anda perhatikan disini adalah letak dari module <code>wsgi</code>,
karena saya di sini menggunakan cookiecutter dari pydanny, maka secara
default, file <code>wsgi.py</code> berada di direktori <code>config</code>. Kalau
menggunakan versi default <code>startproject</code> dari django, file wsgi.py
berada di direktori <code>myproject.wsgi</code>.
</p>

<p>
Selamat mencoba!
</p>
</div>
</div>
